I was just getting back to this issue. The debug flag did not generate any `tfdata.json` file in my current directory. But it did output some more information about the error. I've been able to replicate it in my sample project at https://github.com/jtallar/sample-tf-project-terravision.

I created a new `service` TF module which just imports the `messages` module from before.

```hcl
module "scheduled_messages" {
  source = "../messages"

  sqs_queue_name = "scheduled-events"
}
```

Running `terravision draw` works OK with the `messages` module and it generates the architecture diagram as expected.
`terravision draw --source ~/Desktop/Random/sample-tf-project-terravision/messages`

But if I run it agains the `service` module, it fails with a similar error to the one shown above.

`terravision draw --source ~/Desktop/Random/sample-tf-project-terravision/service --debug`

Here is the complete output of that run.
```
terravision draw --source ~/Desktop/Random/sample-tf-project-terravision/service --debug



 _____                          _     _             
/__   \___ _ __ _ __ __ ___   _(_)___(_) ___  _ __  
  / /\/ _ \ '__| '__/ _` \ \ / / / __| |/ _ \| '_ \ 
 / / |  __/ |  | | | (_| |\ V /| \__ \ | (_) | | | |
 \/   \___|_|  |_|  \__,_| \_/ |_|___/_|\___/|_| |_|
                                                    



Preflight check..
  dot command detected: /opt/homebrew/bin/dot
  gvpr command detected: /opt/homebrew/bin/gvpr
  git command detected: /usr/bin/git
  terraform command detected: /opt/homebrew/bin/terraform
  terraform version detected: Terraform v1.5.7



Initializing the backend...
Upgrading modules...
- scheduled_messages in ../messages

Initializing provider plugins...
- Finding hashicorp/aws versions matching "~> 5.0"...
- Using hashicorp/aws v5.100.0 from the shared cache directory

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.

Initalising workspace: default


Generating Terraform Plan..


Terraform used the selected providers to generate the following execution plan.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.scheduled_messages.aws_iam_role.eventbridge_scheduler_execution_role will be created
  + resource "aws_iam_role" "eventbridge_scheduler_execution_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "scheduler.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "EventBridgeSchedulerExecutionRole-scheduled-events"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # module.scheduled_messages.aws_iam_role_policy.eventbridge_scheduler_sqs_policy will be created
  + resource "aws_iam_role_policy" "eventbridge_scheduler_sqs_policy" {
      + id          = (known after apply)
      + name        = "EventBridgeSchedulerSQSPolicy"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = (known after apply)
    }

  # module.scheduled_messages.aws_scheduler_schedule_group.messages_schedule_group will be created
  + resource "aws_scheduler_schedule_group" "messages_schedule_group" {
      + arn                    = (known after apply)
      + creation_date          = (known after apply)
      + id                     = (known after apply)
      + last_modification_date = (known after apply)
      + name                   = "scheduled-events"
      + name_prefix            = (known after apply)
      + state                  = (known after apply)
      + tags_all               = (known after apply)
    }

  # module.scheduled_messages.aws_sqs_queue.messages_sqs will be created
  + resource "aws_sqs_queue" "messages_sqs" {
      + arn                               = (known after apply)
      + content_based_deduplication       = false
      + deduplication_scope               = (known after apply)
      + delay_seconds                     = 0
      + fifo_queue                        = false
      + fifo_throughput_limit             = (known after apply)
      + id                                = (known after apply)
      + kms_data_key_reuse_period_seconds = (known after apply)
      + max_message_size                  = 262144
      + message_retention_seconds         = 345600
      + name                              = "scheduled-events"
      + name_prefix                       = (known after apply)
      + policy                            = (known after apply)
      + receive_wait_time_seconds         = 0
      + redrive_allow_policy              = (known after apply)
      + redrive_policy                    = (known after apply)
      + sqs_managed_sse_enabled           = (known after apply)
      + tags_all                          = (known after apply)
      + url                               = (known after apply)
      + visibility_timeout_seconds        = 30
    }

  # module.scheduled_messages.aws_sqs_queue.messages_sqs_dlq will be created
  + resource "aws_sqs_queue" "messages_sqs_dlq" {
      + arn                               = (known after apply)
      + content_based_deduplication       = false
      + deduplication_scope               = (known after apply)
      + delay_seconds                     = 0
      + fifo_queue                        = false
      + fifo_throughput_limit             = (known after apply)
      + id                                = (known after apply)
      + kms_data_key_reuse_period_seconds = (known after apply)
      + max_message_size                  = 262144
      + message_retention_seconds         = 345600
      + name                              = "scheduled-events-dlq"
      + name_prefix                       = (known after apply)
      + policy                            = (known after apply)
      + receive_wait_time_seconds         = 0
      + redrive_allow_policy              = (known after apply)
      + redrive_policy                    = (known after apply)
      + sqs_managed_sse_enabled           = (known after apply)
      + tags_all                          = (known after apply)
      + url                               = (known after apply)
      + visibility_timeout_seconds        = 30
    }

  # module.scheduled_messages.aws_sqs_queue_policy.messages_sqs will be created
  + resource "aws_sqs_queue_policy" "messages_sqs" {
      + id        = (known after apply)
      + policy    = (known after apply)
      + queue_url = (known after apply)
    }

Plan: 6 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + message_queue_arn = (known after apply)

───────────────────────────────────────────────────────────────────────────────────

Saved the plan to: /var/folders/4x/00gscj_x4bxc42d_wkymv9540000gn/T/tfplan.bin

To perform exactly these actions, run the following command to apply:
    terraform apply "/var/folders/4x/00gscj_x4bxc42d_wkymv9540000gn/T/tfplan.bin"

Decoding plan..


Analysing plan..


Converting TF Graph Connections..  (this may take a while)

Traceback (most recent call last):
  File "/Users/juliantallar/Desktop/Random/terravision/terravision", line 352, in <module>
    cli(
  File "/Users/juliantallar/.pyenv/versions/3.11.14/lib/python3.11/site-packages/click/core.py", line 1130, in __call__
    return self.main(*args, **kwargs)
           ^^^^^^^^^^^^^^^^^^^^^^^^^^
  File "/Users/juliantallar/.pyenv/versions/3.11.14/lib/python3.11/site-packages/click/core.py", line 1055, in main
    rv = self.invoke(ctx)
         ^^^^^^^^^^^^^^^^
  File "/Users/juliantallar/.pyenv/versions/3.11.14/lib/python3.11/site-packages/click/core.py", line 1657, in invoke
    return _process_result(sub_ctx.command.invoke(sub_ctx))
                           ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
  File "/Users/juliantallar/.pyenv/versions/3.11.14/lib/python3.11/site-packages/click/core.py", line 1404, in invoke
    return ctx.invoke(self.callback, **ctx.params)
           ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
  File "/Users/juliantallar/.pyenv/versions/3.11.14/lib/python3.11/site-packages/click/core.py", line 760, in invoke
    return __callback(*args, **kwargs)
           ^^^^^^^^^^^^^^^^^^^^^^^^^^^
  File "/Users/juliantallar/Desktop/Random/terravision/terravision", line 279, in draw
    tfdata = compile_tfdata(source, varfile, workspace, debug, annotate)
             ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
  File "/Users/juliantallar/Desktop/Random/terravision/terravision", line 136, in compile_tfdata
    tfdata = _process_terraform_source(source, varfile, workspace, annotate, debug)
             ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
  File "/Users/juliantallar/Desktop/Random/terravision/terravision", line 79, in _process_terraform_source
    tfdata = tfwrapper.tf_makegraph(tfdata)
             ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
  File "/Users/juliantallar/Desktop/Random/terravision/modules/tfwrapper.py", line 226, in tf_makegraph
    node_id = gvid_table.index(nodename)
              ^^^^^^^^^^^^^^^^^^^^^^^^^^
ValueError: 'aws_iam_role.eventbridge_scheduler_execution_role' is not in list
```